
*     
*** UI  
***** scroll
******* DONE derive from uki scroll pane [3/3]
        SCHEDULED: <2011-02-19 Sat 11:35>
        CLOCK: [2011-02-19 Sat 19:02]--[2011-02-19 Sat 20:31] =>  1:29
        :PROPERTIES:
        :Effort:   4:00
        :Clockhistory: 3
        | :Clock1: | [2011-02-19 Sat 11:37]--[2011-02-19 Sat 14:22] =>  2:45 | easy method impossible |
        | :Clock2: | [2011-02-19 Sat 14:25]--[2011-02-19 Sat 16:00] =>  1:35 | can not set right w/h  |
        | :Clock3: | [2011-02-19 Sat 18:03]--[2011-02-19 Sat 18:22] =>  0:19 | root cause             |
        :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "derive_from_uki_scroll_pane")
        :END:
        - [X] dev.js
        - [X] make_scroller 
              (link "~/local/src/baza/public/javascripts/lib.scroll.js" 8360)
              there is no easy way, need deep merge the two
        - [X] width setting
******* HALT fix bug for home app
******* tab include different tab
******* orientation compatible
***** component
******* button tab
********* DONE uki solution [2/2]
          SCHEDULED: <2011-02-19 Sat 15:50>
          CLOCK: [2011-02-19 Sat 20:33]--[2011-02-19 Sat 20:56] =>  0:23
          :PROPERTIES:
          :Effort:   1:00
          :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "uki_solution")
          :END:
          - [X] plain segment button layout
          - [X] scroll pane view switch function
********* jquerytools solution
******* chart view
********* DONE solution search
          - zingchart is beautiful, but do not need almost feature
            http://www.zingchart.com 
          - google chart maybe more stable, just return rendered image
            http://code.google.com/apis/ajax/playground/?type=visualization#pie_chart
          - jquery visualize plugin looks plain and use html table
            http://www.filamentgroup.com/dwpe/#codeexamples
          - jqplot, plain
            http://www.jqplot.com/tests/highlighterTests.php
          - highchart export/print support is nice, seems very fast
            (though SVG)
            http://www.highcharts.com/demo/?example=area-inverted&theme=gray
            it's code is best
********* build
*********** DONE build block [5/7]
            SCHEDULED: <2011-02-19 Sat 17:05>
            CLOCK: [2011-02-19 Sat 21:00]--[2011-02-19 Sat 22:21] =>  1:21
            :PROPERTIES:
            :Effort:   2:30
            :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "build_block")
            :END:
            - [X] stand out font
                  3.2 has bug, use strokeText
            - [X] mark font
            - [X] color scheme
            - [X] shadow
            - [X] transparent
            - [ ] overlay
            - [ ] jumper
*********** TODO layout [4/4]
            SCHEDULED: <2011-02-19 Sat 19:50>
            :PROPERTIES:
            :Effort:   3:00
            :Clockhistory: 3
            | :Clock1: | [2011-02-20 Sun 09:41]--[2011-02-20 Sun 13:03] =>  3:22 | init             |
            | :Clock2: | [2011-02-20 Sun 16:03]--[2011-02-20 Sun 20:57] =>  4:54 | break            |
            | :Clock3: | [2011-02-21 Mon 10:33]--[2011-02-21 Mon 11:45] =>  1:12 | performance data |
            :END:
            - [X] day
                - stand out number
                - date
                - hour mark
                - color array
                - task overlay
            - [X] multiple canvas in scroll pane
            - [X] week
                - stand out number
                - day mark
                - day jumper
            - [X] month
                - stand out number
                - week mark
                - week jumper
*********** TODO performance [1/4]
            :PROPERTIES:
            :Effort:   2:00
            :END:
            - [X] profile
  
                |------+-------+------------------------------------------------|
                | Self | Total | Function                                       |
                |------+-------+------------------------------------------------|
                | 84ms | 91ms  | Script:-http://localhost:3333/progress_bar.cjs |
                | 21ms | 21ms  | toDataURL                                      |
                | 18ms | 33ms  | dispatch                                       |
                | 15ms | 15ms  | dispatch-{1}                                   |
                | 15ms | 20ms  | Script:-http://localhost:3333/lib.prototype.js |
                | 13ms | 13ms  | set-src                                        |
                | 11ms | 11ms  | fillRect                                       |
                | 8ms  | 10ms  | InjectedScript.dispatch                        |
                | 7ms  | 89ms  | progress_bar.cjs:10626-make_gauge              |
                | 5ms  | 5ms   | stroke                                         |
                | 4ms  | 28ms  | progress_bar.cjs:10024-gauge.add               |
                | 4ms  | 4ms   | drawImage                                      |
                | 4ms  | 14ms  | progress_bar.cjs:3775-init                     |
                | 3ms  | 3ms   | progress_bar.cjs:10025-uniqueID                |
                | 3ms  | 3ms   | get-cssText                                    |
                | 3ms  | 3ms   | getStyles                                      |
                | 3ms  | 20ms  | progress_bar.cjs:10114-gauge.modify            |
                | 2ms  | 2ms   | InjectedScript._ensureCommandLineAPIInstalled  |
                | 2ms  | 2ms   | set-className                                  |
                | 2ms  | 2ms   | cloneNode                                      |
                | 2ms  | 2ms   | progress_bar.cjs:9395-Scroller                 |
                | 2ms  | 3ms   | progress_bar.cjs:2400-uki.view.declare         |
                |------+-------+------------------------------------------------|

                |-------+---------+---------+---------|
                |       | Code    | Objects | Total   |
                |-------+---------+---------+---------|
                | count | 7072    | 34093   | 41165   |
                | size  | 2.177MB | 2.198MB | 4.375MB |
                |-------+---------+---------+---------|

                |--------------------------+-------+----------|
                | Constructor              | Count | Size     |
                |--------------------------+-------+----------|
                | (code)                   |  7072 | 2.177MB  |
                | (closure)                |  5981 | 761.32KB |
                | String                   | 11738 | 319.34KB |
                | Array                    |  8519 | 316.16KB |
                | Object                   |  2469 | 140.54KB |
                | Function                 |  2460 | 77.81KB  |
                | (anonymous)              |    15 | 62.88KB  |
                | HTMLCanvasElement        |    21 | 49.01KB  |
                | inheritance              |    56 | 26.16KB  |
                | klass                    |    52 | 19.32KB  |
                | (global_property)        |  1908 | 14.91KB  |
                | RegExp                   |    88 | 4.47KB   |
                | uki.fn.uki.Collection    |     1 | 3.04KB   |
                | HTMLDivElement           |    73 | 2.69KB   |
                | RangeError               |     4 | 1.66KB   |
                | Arguments                |    35 | 1.11KB   |
                |--------------------------+-------+----------|

            - [ ] guage code style
            - [ ] remove toDataURL method
            - [ ] painting code
*********** ABORT try highchart
*********** TODO json -> canvas code [1/2]
            SCHEDULED: <2011-02-20 Sun 02:15>
            :PROPERTIES:
            :Effort:   1:00
            :END:
            - [ ] var
            - [X] ajax
                  if build all into one huge html, this is unnecessary 
******* DONE font

        - at least iphone4 do not support HTML5 font feature
          can refer http://ballotbucks.org/
        - finally use strokeText
        
*** Exporter
***** TODO org -> json/sheet [0/4]
      SCHEDULED: <2011-02-20 Sun 03:30>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [ ] agenda how to
      - [ ] single file exporter
      - [ ] multiple file exporter
      - [ ] save hook
***** TODO json/sheet diff -> notification message  [0/7]
      SCHEDULED: <2011-02-20 Sun 08:45>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [ ] server.rb
      - [ ] compare Object
      - [ ] message generator
      - [ ] git push function
      - [ ] notify function
      - [ ] hook git push
      - [ ] hook notifo
*** DONE Notify
    it works from beginning
